@rrmestl-cx where did you get the data for `writer_identity` in below config? Can you verify if it exists? 

> p197201731551-137007@gcp-sa-logging.iam.gserviceaccount.com

```
  # module.global.module.base.google_logging_project_sink.robm_cloud_func_test_sink will be created
  + resource "google_logging_project_sink" "robm_cloud_func_test_sink" {
      + description            = "sink to handle RobM Cloud Func tests"
      + destination            = "pubsub.googleapis.com/projects/ivr-divasp-sysdev-dev-01/topics/robm-cloud-func-test-topic"
      + filter                 = "resource.type = gce_instance AND (textPayload =~ \"robm-cloud-func-test:\" OR textPayload =~ \"robm-cloud-func-test\\[.*?\\]: ERROR\" OR jsonPayload.message =~ \"robm-cloud-func-test:\" OR jsonPayload.message =~ \"robm-cloud-func-test\\[.*?\\]: ERROR\" OR jsonPayload.syslog_tag = \"robm-cloud-func-test\")"
      + id                     = (known after apply)
      + name                   = "robm-cloud-func-test-sink"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }
```